; domain
(define (domain emergency)
  (:requirements :strips :typing)

  (:types
    drone
    person
    crate
    location
    content
    arm
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (arm-of ?a - arm ?d - drone)
    (free ?a - arm)
    (holding ?a - arm ?c - crate)

    (crate-has ?c - crate ?t - content)
    (person-has ?p - person ?t - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
    )
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and
      (at-drone ?d ?l)
      (at-crate ?c ?l)
      (arm-of ?a ?d)
      (free ?a)
    )
    :effect (and
      (not (at-crate ?c ?l))
      (not (free ?a))
      (holding ?a ?c)
    )
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?t - content)
    :precondition (and
      (at-drone ?d ?l)
      (at-person ?p ?l)
      (arm-of ?a ?d)
      (holding ?a ?c)
      (crate-has ?c ?t)
    )
    :effect (and
      (person-has ?p ?t)
      (free ?a)
      (not (holding ?a ?c))
    )
  )

)

; problem
(define (problem emergency_d1_l30_p30_c30_g30)
(:domain emergency)
(:objects
	drone1 - drone
	drone1_arm1 - arm
	drone1_arm2 - arm
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
)
(:init
	(at-drone drone1 depot)
	(arm-of drone1_arm1 drone1)
	(arm-of drone1_arm2 drone1)
	(free drone1_arm1)
	(free drone1_arm2)
	(at-crate crate1 depot)
	(at-crate crate2 depot)
	(at-crate crate3 depot)
	(at-crate crate4 depot)
	(at-crate crate5 depot)
	(at-crate crate6 depot)
	(at-crate crate7 depot)
	(at-crate crate8 depot)
	(at-crate crate9 depot)
	(at-crate crate10 depot)
	(at-crate crate11 depot)
	(at-crate crate12 depot)
	(at-crate crate13 depot)
	(at-crate crate14 depot)
	(at-crate crate15 depot)
	(at-crate crate16 depot)
	(at-crate crate17 depot)
	(at-crate crate18 depot)
	(at-crate crate19 depot)
	(at-crate crate20 depot)
	(at-crate crate21 depot)
	(at-crate crate22 depot)
	(at-crate crate23 depot)
	(at-crate crate24 depot)
	(at-crate crate25 depot)
	(at-crate crate26 depot)
	(at-crate crate27 depot)
	(at-crate crate28 depot)
	(at-crate crate29 depot)
	(at-crate crate30 depot)
	(crate-has crate1 food)
	(crate-has crate2 food)
	(crate-has crate3 food)
	(crate-has crate4 food)
	(crate-has crate5 food)
	(crate-has crate6 food)
	(crate-has crate7 food)
	(crate-has crate8 food)
	(crate-has crate9 medicine)
	(crate-has crate10 medicine)
	(crate-has crate11 medicine)
	(crate-has crate12 medicine)
	(crate-has crate13 medicine)
	(crate-has crate14 medicine)
	(crate-has crate15 medicine)
	(crate-has crate16 medicine)
	(crate-has crate17 medicine)
	(crate-has crate18 medicine)
	(crate-has crate19 medicine)
	(crate-has crate20 medicine)
	(crate-has crate21 medicine)
	(crate-has crate22 medicine)
	(crate-has crate23 medicine)
	(crate-has crate24 medicine)
	(crate-has crate25 medicine)
	(crate-has crate26 medicine)
	(crate-has crate27 medicine)
	(crate-has crate28 medicine)
	(crate-has crate29 medicine)
	(crate-has crate30 medicine)
	(at-person person1 loc10)
	(at-person person2 loc11)
	(at-person person3 loc5)
	(at-person person4 loc7)
	(at-person person5 loc10)
	(at-person person6 loc22)
	(at-person person7 loc12)
	(at-person person8 loc2)
	(at-person person9 loc2)
	(at-person person10 loc25)
	(at-person person11 loc15)
	(at-person person12 loc5)
	(at-person person13 loc18)
	(at-person person14 loc7)
	(at-person person15 loc20)
	(at-person person16 loc4)
	(at-person person17 loc30)
	(at-person person18 loc11)
	(at-person person19 loc16)
	(at-person person20 loc20)
	(at-person person21 loc1)
	(at-person person22 loc30)
	(at-person person23 loc14)
	(at-person person24 loc24)
	(at-person person25 loc29)
	(at-person person26 loc14)
	(at-person person27 loc18)
	(at-person person28 loc19)
	(at-person person29 loc23)
	(at-person person30 loc5)
)
(:goal (and
	(at-drone drone1 depot)
	(person-has person1 food)
	(person-has person1 medicine)
	(person-has person3 food)
	(person-has person3 medicine)
	(person-has person4 medicine)
	(person-has person5 medicine)
	(person-has person7 food)
	(person-has person7 medicine)
	(person-has person8 medicine)
	(person-has person9 medicine)
	(person-has person10 food)
	(person-has person10 medicine)
	(person-has person11 medicine)
	(person-has person12 medicine)
	(person-has person13 food)
	(person-has person13 medicine)
	(person-has person15 food)
	(person-has person16 food)
	(person-has person16 medicine)
	(person-has person17 medicine)
	(person-has person19 medicine)
	(person-has person20 medicine)
	(person-has person21 medicine)
	(person-has person22 medicine)
	(person-has person23 medicine)
	(person-has person24 medicine)
	(person-has person26 medicine)
	(person-has person27 medicine)
	(person-has person28 food)
	(person-has person28 medicine)
))
)

; plan
1. (pick-up drone1 drone1_arm1 crate30 depot)
   deleted: (at-crate crate30 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate30)
   goals met: 1 of 31
2. (pick-up drone1 drone1_arm2 crate8 depot)
   deleted: (at-crate crate8 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate8)
   goals met: 1 of 31
3. (fly drone1 depot loc24)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc24)
   goals met: 0 of 31
4. (deliver drone1 drone1_arm1 crate30 person24 loc24 medicine)
   deleted: (holding drone1_arm1 crate30)
   added: (person-has person24 medicine) (free drone1_arm1)
   goals met: 1 of 31
5. (fly drone1 loc24 depot)
   deleted: (at-drone drone1 loc24)
   added: (at-drone drone1 depot)
   goals met: 2 of 31
6. (pick-up drone1 drone1_arm1 crate29 depot)
   deleted: (at-crate crate29 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate29)
   goals met: 2 of 31
7. (fly drone1 depot loc16)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc16)
   goals met: 1 of 31
8. (deliver drone1 drone1_arm1 crate29 person19 loc16 medicine)
   deleted: (holding drone1_arm1 crate29)
   added: (person-has person19 medicine) (free drone1_arm1)
   goals met: 2 of 31
9. (fly drone1 loc16 depot)
   deleted: (at-drone drone1 loc16)
   added: (at-drone drone1 depot)
   goals met: 3 of 31
10. (pick-up drone1 drone1_arm1 crate28 depot)
   deleted: (at-crate crate28 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate28)
   goals met: 3 of 31
11. (fly drone1 depot loc15)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc15)
   goals met: 2 of 31
12. (deliver drone1 drone1_arm1 crate28 person11 loc15 medicine)
   deleted: (holding drone1_arm1 crate28)
   added: (person-has person11 medicine) (free drone1_arm1)
   goals met: 3 of 31
13. (fly drone1 loc15 depot)
   deleted: (at-drone drone1 loc15)
   added: (at-drone drone1 depot)
   goals met: 4 of 31
14. (pick-up drone1 drone1_arm1 crate27 depot)
   deleted: (at-crate crate27 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate27)
   goals met: 4 of 31
15. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 3 of 31
16. (deliver drone1 drone1_arm1 crate27 person4 loc7 medicine)
   deleted: (holding drone1_arm1 crate27)
   added: (person-has person4 medicine) (free drone1_arm1)
   goals met: 4 of 31
17. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 5 of 31
18. (pick-up drone1 drone1_arm1 crate26 depot)
   deleted: (at-crate crate26 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate26)
   goals met: 5 of 31
19. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 4 of 31
20. (deliver drone1 drone1_arm1 crate26 person21 loc1 medicine)
   deleted: (holding drone1_arm1 crate26)
   added: (person-has person21 medicine) (free drone1_arm1)
   goals met: 5 of 31
21. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 6 of 31
22. (pick-up drone1 drone1_arm1 crate25 depot)
   deleted: (at-crate crate25 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate25)
   goals met: 6 of 31
23. (fly drone1 depot loc30)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc30)
   goals met: 5 of 31
24. (deliver drone1 drone1_arm1 crate25 person17 loc30 medicine)
   deleted: (holding drone1_arm1 crate25)
   added: (person-has person17 medicine) (free drone1_arm1)
   goals met: 6 of 31
25. (fly drone1 loc30 depot)
   deleted: (at-drone drone1 loc30)
   added: (at-drone drone1 depot)
   goals met: 7 of 31
26. (pick-up drone1 drone1_arm1 crate24 depot)
   deleted: (at-crate crate24 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate24)
   goals met: 7 of 31
27. (fly drone1 depot loc30)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc30)
   goals met: 6 of 31
28. (deliver drone1 drone1_arm1 crate24 person22 loc30 medicine)
   deleted: (holding drone1_arm1 crate24)
   added: (person-has person22 medicine) (free drone1_arm1)
   goals met: 7 of 31
29. (fly drone1 loc30 depot)
   deleted: (at-drone drone1 loc30)
   added: (at-drone drone1 depot)
   goals met: 8 of 31
30. (pick-up drone1 drone1_arm1 crate23 depot)
   deleted: (at-crate crate23 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate23)
   goals met: 8 of 31
31. (fly drone1 depot loc25)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc25)
   goals met: 7 of 31
32. (deliver drone1 drone1_arm2 crate8 person10 loc25 food)
   deleted: (holding drone1_arm2 crate8)
   added: (person-has person10 food) (free drone1_arm2)
   goals met: 8 of 31
33. (deliver drone1 drone1_arm1 crate23 person10 loc25 medicine)
   deleted: (holding drone1_arm1 crate23)
   added: (person-has person10 medicine) (free drone1_arm1)
   goals met: 9 of 31
34. (fly drone1 loc25 depot)
   deleted: (at-drone drone1 loc25)
   added: (at-drone drone1 depot)
   goals met: 10 of 31
35. (pick-up drone1 drone1_arm1 crate22 depot)
   deleted: (at-crate crate22 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate22)
   goals met: 10 of 31
36. (pick-up drone1 drone1_arm2 crate7 depot)
   deleted: (at-crate crate7 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate7)
   goals met: 10 of 31
37. (fly drone1 depot loc20)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc20)
   goals met: 9 of 31
38. (deliver drone1 drone1_arm2 crate7 person15 loc20 food)
   deleted: (holding drone1_arm2 crate7)
   added: (person-has person15 food) (free drone1_arm2)
   goals met: 10 of 31
39. (deliver drone1 drone1_arm1 crate22 person20 loc20 medicine)
   deleted: (holding drone1_arm1 crate22)
   added: (person-has person20 medicine) (free drone1_arm1)
   goals met: 11 of 31
40. (fly drone1 loc20 depot)
   deleted: (at-drone drone1 loc20)
   added: (at-drone drone1 depot)
   goals met: 12 of 31
41. (pick-up drone1 drone1_arm1 crate21 depot)
   deleted: (at-crate crate21 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate21)
   goals met: 12 of 31
42. (pick-up drone1 drone1_arm2 crate6 depot)
   deleted: (at-crate crate6 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate6)
   goals met: 12 of 31
43. (fly drone1 depot loc19)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc19)
   goals met: 11 of 31
44. (deliver drone1 drone1_arm2 crate6 person28 loc19 food)
   deleted: (holding drone1_arm2 crate6)
   added: (person-has person28 food) (free drone1_arm2)
   goals met: 12 of 31
45. (deliver drone1 drone1_arm1 crate21 person28 loc19 medicine)
   deleted: (holding drone1_arm1 crate21)
   added: (person-has person28 medicine) (free drone1_arm1)
   goals met: 13 of 31
46. (fly drone1 loc19 depot)
   deleted: (at-drone drone1 loc19)
   added: (at-drone drone1 depot)
   goals met: 14 of 31
47. (pick-up drone1 drone1_arm1 crate20 depot)
   deleted: (at-crate crate20 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate20)
   goals met: 14 of 31
48. (pick-up drone1 drone1_arm2 crate5 depot)
   deleted: (at-crate crate5 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate5)
   goals met: 14 of 31
49. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 13 of 31
50. (deliver drone1 drone1_arm2 crate5 person13 loc18 food)
   deleted: (holding drone1_arm2 crate5)
   added: (person-has person13 food) (free drone1_arm2)
   goals met: 14 of 31
51. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 15 of 31
52. (pick-up drone1 drone1_arm2 crate4 depot)
   deleted: (at-crate crate4 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate4)
   goals met: 15 of 31
53. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 14 of 31
54. (deliver drone1 drone1_arm1 crate20 person13 loc18 medicine)
   deleted: (holding drone1_arm1 crate20)
   added: (person-has person13 medicine) (free drone1_arm1)
   goals met: 15 of 31
55. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 16 of 31
56. (pick-up drone1 drone1_arm1 crate19 depot)
   deleted: (at-crate crate19 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate19)
   goals met: 16 of 31
57. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 15 of 31
58. (deliver drone1 drone1_arm1 crate19 person27 loc18 medicine)
   deleted: (holding drone1_arm1 crate19)
   added: (person-has person27 medicine) (free drone1_arm1)
   goals met: 16 of 31
59. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 17 of 31
60. (pick-up drone1 drone1_arm1 crate18 depot)
   deleted: (at-crate crate18 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate18)
   goals met: 17 of 31
61. (fly drone1 depot loc14)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc14)
   goals met: 16 of 31
62. (deliver drone1 drone1_arm1 crate18 person23 loc14 medicine)
   deleted: (holding drone1_arm1 crate18)
   added: (person-has person23 medicine) (free drone1_arm1)
   goals met: 17 of 31
63. (fly drone1 loc14 depot)
   deleted: (at-drone drone1 loc14)
   added: (at-drone drone1 depot)
   goals met: 18 of 31
64. (pick-up drone1 drone1_arm1 crate17 depot)
   deleted: (at-crate crate17 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate17)
   goals met: 18 of 31
65. (fly drone1 depot loc14)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc14)
   goals met: 17 of 31
66. (deliver drone1 drone1_arm1 crate17 person26 loc14 medicine)
   deleted: (holding drone1_arm1 crate17)
   added: (person-has person26 medicine) (free drone1_arm1)
   goals met: 18 of 31
67. (fly drone1 loc14 depot)
   deleted: (at-drone drone1 loc14)
   added: (at-drone drone1 depot)
   goals met: 19 of 31
68. (pick-up drone1 drone1_arm1 crate16 depot)
   deleted: (at-crate crate16 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate16)
   goals met: 19 of 31
69. (fly drone1 depot loc12)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc12)
   goals met: 18 of 31
70. (deliver drone1 drone1_arm2 crate4 person7 loc12 food)
   deleted: (holding drone1_arm2 crate4)
   added: (person-has person7 food) (free drone1_arm2)
   goals met: 19 of 31
71. (deliver drone1 drone1_arm1 crate16 person7 loc12 medicine)
   deleted: (holding drone1_arm1 crate16)
   added: (person-has person7 medicine) (free drone1_arm1)
   goals met: 20 of 31
72. (fly drone1 loc12 depot)
   deleted: (at-drone drone1 loc12)
   added: (at-drone drone1 depot)
   goals met: 21 of 31
73. (pick-up drone1 drone1_arm1 crate15 depot)
   deleted: (at-crate crate15 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate15)
   goals met: 21 of 31
74. (pick-up drone1 drone1_arm2 crate3 depot)
   deleted: (at-crate crate3 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate3)
   goals met: 21 of 31
75. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 20 of 31
76. (deliver drone1 drone1_arm2 crate3 person1 loc10 food)
   deleted: (holding drone1_arm2 crate3)
   added: (person-has person1 food) (free drone1_arm2)
   goals met: 21 of 31
77. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 22 of 31
78. (pick-up drone1 drone1_arm2 crate2 depot)
   deleted: (at-crate crate2 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate2)
   goals met: 22 of 31
79. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 21 of 31
80. (deliver drone1 drone1_arm1 crate15 person1 loc10 medicine)
   deleted: (holding drone1_arm1 crate15)
   added: (person-has person1 medicine) (free drone1_arm1)
   goals met: 22 of 31
81. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 23 of 31
82. (pick-up drone1 drone1_arm1 crate14 depot)
   deleted: (at-crate crate14 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate14)
   goals met: 23 of 31
83. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 22 of 31
84. (deliver drone1 drone1_arm1 crate14 person5 loc10 medicine)
   deleted: (holding drone1_arm1 crate14)
   added: (person-has person5 medicine) (free drone1_arm1)
   goals met: 23 of 31
85. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 24 of 31
86. (pick-up drone1 drone1_arm1 crate13 depot)
   deleted: (at-crate crate13 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate13)
   goals met: 24 of 31
87. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 23 of 31
88. (deliver drone1 drone1_arm2 crate2 person3 loc5 food)
   deleted: (holding drone1_arm2 crate2)
   added: (person-has person3 food) (free drone1_arm2)
   goals met: 24 of 31
89. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 25 of 31
90. (pick-up drone1 drone1_arm2 crate1 depot)
   deleted: (at-crate crate1 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate1)
   goals met: 25 of 31
91. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 24 of 31
92. (deliver drone1 drone1_arm2 crate1 person16 loc4 food)
   deleted: (holding drone1_arm2 crate1)
   added: (person-has person16 food) (free drone1_arm2)
   goals met: 25 of 31
93. (deliver drone1 drone1_arm1 crate13 person16 loc4 medicine)
   deleted: (holding drone1_arm1 crate13)
   added: (person-has person16 medicine) (free drone1_arm1)
   goals met: 26 of 31
94. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 27 of 31
95. (pick-up drone1 drone1_arm1 crate12 depot)
   deleted: (at-crate crate12 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate12)
   goals met: 27 of 31
96. (pick-up drone1 drone1_arm2 crate11 depot)
   deleted: (at-crate crate11 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate11)
   goals met: 27 of 31
97. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 26 of 31
98. (deliver drone1 drone1_arm2 crate11 person3 loc5 medicine)
   deleted: (holding drone1_arm2 crate11)
   added: (person-has person3 medicine) (free drone1_arm2)
   goals met: 27 of 31
99. (deliver drone1 drone1_arm1 crate12 person12 loc5 medicine)
   deleted: (holding drone1_arm1 crate12)
   added: (person-has person12 medicine) (free drone1_arm1)
   goals met: 28 of 31
100. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 29 of 31
101. (pick-up drone1 drone1_arm1 crate10 depot)
   deleted: (at-crate crate10 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate10)
   goals met: 29 of 31
102. (pick-up drone1 drone1_arm2 crate9 depot)
   deleted: (at-crate crate9 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate9)
   goals met: 29 of 31
103. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 28 of 31
104. (deliver drone1 drone1_arm2 crate9 person8 loc2 medicine)
   deleted: (holding drone1_arm2 crate9)
   added: (person-has person8 medicine) (free drone1_arm2)
   goals met: 29 of 31
105. (deliver drone1 drone1_arm1 crate10 person9 loc2 medicine)
   deleted: (holding drone1_arm1 crate10)
   added: (person-has person9 medicine) (free drone1_arm1)
   goals met: 30 of 31
106. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 31 of 31
